toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    [[gnu::section(".stack._SDTask")]]
    static inline uint8_t Stack[256];
};

static void _SDStateReset(const SD::CardId& cardId, const SD::CardData& cardData) {
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    // Mark the _State as invalid in case we lose power in the middle of modifying it
    _State.sd.valid = false;
    
    // Set .cardId
    {
        _State.sd.cardId = cardId;
    }
    
    // Set .imgCap
    {
        // ImgBlockLen: the length of an image in SD blocks
        constexpr uint32_t ImgBlockLen = Img::PaddedLen / SD::BlockLen;
        // cardBlockCap: the capacity of the SD card in SD blocks (1 block == 512 bytes)
        const uint32_t cardBlockCap = ((uint32_t)GetBits<69,48>(cardData)+1) * (uint32_t)1024;
        // cardImgCap: the capacity of the SD card in number of images
        const uint32_t cardImgCap = cardBlockCap / ImgBlockLen;
        
        _State.sd.imgCap = cardImgCap;
    }
    
    // Set .ringBufs
    {
        _State.sd.ringBufs[0] = {};
        _State.sd.ringBufs[1] = {};
    }
    
    _State.sd.valid = true;
}

static void _SDInit() {
    _SDTask::Wait();
    
    // If the SD state is valid, and we've already verified the SD card ID,
    // enable the SD card asynchronously
    if (_State.sd.valid && _SDCardIdVerified) {
        _SDTask::EnableAsync();
        return;
    }
    
    // Otherwise, enable the SD card synchronously because we need the card id / card data
    SD::CardId cardId;
    SD::CardData cardData;
    _SDTask::Enable(&cardId, &cardData);
    
    // If the SD state isn't valid, or the existing SD card id doesn't
    // match the current card id, then reset the SD state
    if (!_State.sd.valid || memcmp(&_State.sd.cardId, &cardId, sizeof(cardId))) {
        _SDStateReset(cardId, cardData);
    }
    
    _SDCardIdVerified = true;
    
//    if (!_State.sd.valid || !_SDCardIdVerified) {
//        SD::CardId cardId;
//        SD::CardData cardData;
//        
//        _Scheduler::Start<_SDTask>([] { _SDCard.enable(&cardId, &cardData); });
//        _SDTask::Wait();
//        
//        if (!_State.sd.valid) {
//            _State.sd.cardId = cardId;
//            
//            // ImgBlockLen: the length of an image in 
//            constexpr uint32_t ImgBlockLen = Img::PaddedLen / SD::BlockLen;
//            // cardBlockCap: the capacity of the SD card in SD blocks (1 block == 512 bytes)
//            const uint32_t cardBlockCap = ((uint32_t)GetBits<69,48>(cardData)+1) * (uint32_t)1024;
//            // cardImgCap: the capacity of the SD card in number of images
//            const uint32_t cardImgCap = cardBlockCap / ImgBlockLen;
//            
//            _State.sd.imgCap = cardImgCap;
////            // cardId: the SD card's CID, used to determine when the SD card has been
////            // changed, and therefore we need to update `imgCap` and reset `ringBufs`
////            SD::CardId cardId;
////            // imgCap: image capacity; the number of images that bounds the ring buffer
////            uint32_t imgCap = 0;
////            // ringBufs: tracks captured images on the SD card; 2 copies in case there's a
////            // power failure
////            ImgRingBuf ringBufs[2] = {};
////            uint16_t valid = false; // uint16_t (instead of bool) for alignment
//        }
//    
//    } else {
//        _Scheduler::Start<_SDTask>([] { _SDCard.enable(); });
//    }
//    
//    if (cardIdPtr || cardDataPtr) {
//        _SDCard.enable(cardIdPtr, cardDataPtr);
//    } else {
//        _SDTask::Wait();
//        _Scheduler::Start<_SDTask>([] { _SDCard.enable(); });
//    }
//    
//    
//    _SDCard.enable(cardIdPtr, cardDataPtr);
//    
//    
//    if (!_State.sd.valid || !_SDCardIdVerified) {
//        
//    }
}

struct _ImgTask {
    static void EnableAsync() {
        Wait();
        _Scheduler::Start<_ImgTask>([] {
            // Initialize image sensor
            _ImgSensor::Enable();
            // Set the initial exposure _before_ we enable streaming, so that the very first frame
            // has the correct exposure, so we don't have to skip any frames on the first capture.
            _ImgSensor::SetCoarseIntTime(_ImgAutoExp.integrationTime());
            // Enable image streaming
            _ImgSensor::SetStreamEnabled(true);
        });
    }
    
    static void DisableAsync() {
        Wait();
        _Scheduler::Start<_ImgTask>(_ImgSensor::Disable);
    }
    
    static void Wait() {
        _Scheduler::Wait<_ImgTask>();
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._ImgTask")]]
    static inline uint8_t Stack[128];
};

// MARK: - Motion

static volatile bool _Motion = false;
static volatile bool _Busy = false;

//template <typename T>
//static void _ImgRingBufSet(volatile MSP::ImgRingBuf& dst, const T& src) {
//    FRAMWriteEn writeEn; // Enable FRAM writing
//    
//    dst.valid = false;
//    atomic_thread_fence(std::memory_order_seq_cst);
//    
//    (const_cast<MSP::ImgRingBuf&>(dst)).buf = const_cast<MSP::ImgRingBuf&>(src).buf;
//    atomic_thread_fence(std::memory_order_seq_cst);
//    
//    dst.valid = true;
//}

// _ImgRingBufInit: find the correct ring buffer (the one with the greatest id that's valid)
// and copy it into the other slot so that there are two copies. If neither slot contains a valid ring
// buffer, reset them both so that they're both empty (and valid).
static void _ImgRingBufInit() {
    using namespace MSP;
    
    FRAMWriteEn writeEn; // Enable FRAM writing
    MSP::ImgRingBuf& a = _State.sd.ringBufs[0];
    MSP::ImgRingBuf& b = _State.sd.ringBufs[1];
    const std::optional<int> comp = ImgRingBuf::Compare(a, b);
    if (comp && *comp>0) {
        // a>b (a is newer), so set b=a
        b = a;
    
    } else if (comp && *comp<0) {
        // b>a (b is newer), so set a=b
        a = b;
    
    } else if (!comp) {
        // Both a and b are invalid; reset them both
        a = {};
        b = {};
    }
}

static void _ImgRingBufIncrement() {
    using namespace MSP;
    
    // Update .ringBufs[0]
    {
        ImgRingBuf& ringBuf = _State.sd.ringBufs[0];
        ringBuf.valid = false;
        
        // Update write index
        ringBuf.buf.widx++;
        // Wrap widx
        if (ringBuf.buf.widx >= _State.sd.imgCap) ringBuf.buf.widx = 0;
        
        // Update read index (if we're currently full)
        if (ringBuf.buf.full) {
            ringBuf.buf.ridx++;
            // Wrap ridx
            if (ringBuf.buf.ridx >= _State.sd.imgCap) ringBuf.buf.ridx = 0;
            
            // Update the beginning image id (which only gets incremented if we're full)
            ringBuf.buf.idBegin++;
        }
        
